#+title: My JavaScript Learning Journey
#+author: zijian ying
#+PROPERTY: header-args:js :results output

* Type Conversions
这里是我关于类型转换的笔记。

#+BEGIN_SRC js
let value = true;
console.log(typeof value);
value = String(value);
console.log(typeof value);
#+END_SRC

#+RESULTS:
: boolean
: string

* Math Operations
关于数学运算的学习，比如一元运算符。

#+BEGIN_SRC js
let x = 1;
x = -x;
console.log( x );
#+END_SRC

#+RESULTS:
: -1

#+begin_src js

console.log( 5 % 2 ); // 1, the remainder of 5 divided by 2
console.log( 8 % 3 ); // 2, the remainder of 8 divided by 3
console.log( 8 % 4 ); // 0, the remainder of 8 divided by 4
#+end_src

#+RESULTS:
: 1
: 2
: 0

#+begin_src js

console.log( 2 ** 2 ); // 2² = 4
console.log( 2 ** 3 ); // 2³ = 8
console.log( 2 ** 4 ); // 2⁴ = 16
#+end_src

#+RESULTS:
: 4
: 8
: 16

#+begin_src js
console.log( 4 ** (1/2) ); // 2 (power of 1/2 is the same as a square root)
console.log( 8 ** (1/3) ); // 2 (power of 1/3 is the same as a cubic root)

#+end_src

#+RESULTS:
: 2
: 2

#+begin_src js
let s = "my" + "string";
console.log(s); // mystring

#+end_src

#+RESULTS:
: mystring

#+begin_src js
// No effect on numbers
let x = 1;
console.log( +x ); // 1

let y = -2;
console.log( +y ); // -2

// Converts non-numbers
console.log( +true ); // 1
console.log( +"" );   // 0

#+end_src

#+RESULTS:
: 1
: -2
: 1
: 0

#+begin_src js
let apples = "2";
let oranges = "3";

// both values converted to numbers before the binary plus
console.log( +apples + +oranges ); // 5

// the longer variant
// alert( Number(apples) + Number(oranges) ); // 5

#+end_src

#+RESULTS:
: 5
** task the postix and prefix form -What are the final values of all variables a, b, c and d after the code below?
#+begin_src js

let a = 1, b = 1;

let c = ++a; // ?
let d = b++; // ?
console.log(c)
console.log(a)
console.log(b)
console.log(d)
#+end_src

#+RESULTS:
: 2
: 2
: 2
: 1
** assignment resultk -What are the values of a and x after the code below?
#+begin_src js
let a = 2;

let x = 1 + (a *= 2);

console.log(x)
console.log(a)
#+end_src

#+RESULTS:
: 5
: 4
** types conversions -What are results of these expressions?
#+begin_src js
console.log("" + 1 + 0)
console.log("" - 1 + 0)
console.log(true + false)
console.log(6 / "3")
console.log("2" * "3")
console.log(4 + 5 + "px")
console.log("$" + 4 + 5)
console.log("4" - 2)
console.log("4px" - 2)
console.log("  -9  " + 5)
console.log("  -9  " - 5)
console.log(null + 1)
console.log(undefined + 1)
console.log(" \t \n" - 2)
#+end_src

#+RESULTS:
#+begin_example
10
-1
1
2
6
9px
$45
2
NaN
-9  5
-14
1
NaN
-2
#+end_example

** fix the addition
#+begin_src js
let a = 1
let b = 2

console.log(a + b); // 12

#+end_src

#+RESULTS:
: 3

* comparisons
#+begin_src js
console.log( 2 > 1 );  // true (correct))
console.log( 2 == 1 ); // false (wrong))
console.log( 2 != 1 ); // true (correct))

#+end_src

#+RESULTS:
: true
: false
: true

** task
#+begin_src js
console.log(5 > 4)
console.log("apple" > "pineapple")
console.log("2" > "12")
console.log(undefined == null)
console.log(undefined === null)
console.log(null == "\n0\n")
console.log(null === +"\n0\n")

#+end_src

#+RESULTS:
: true
: false
: true
: true
: false
: false
: false

* condintional branching if and ?

** task
#+begin_src js
if ("0") {
console.log( 'Hello' );
}

#+end_src

#+RESULTS:
: Hello

#+begin_src js
let cond = ""
if(cond == "ECMAScript"){
console.log("RIGHT")
}else{
console.log("you dont konw , EMCAScript")
}
#+end_src

#+RESULTS:
: you dont konw , EMCAScript

#+begin_src js
let a = 4
let b = 1
let result = a+b <4 ? 'Below':'Over'
console.log(result)
#+end_src

#+RESULTS:
: Over

#+begin_src js
let login = 'jj'
let message;


message = (login == 'Employee') ? 'Hello':(login == 'Director') ? 'Greetings' : (login == '') ? 'No login' : ''
console.log(message)
#+end_src

#+RESULTS:
:
#+begin_src js
for (let i = 0; i < 10; i++) {

// if true, skip the remaining part of the body
if (i % 2 == 0) continue;

console.log(i); // 1, then 3, 5, 7, 9
}

#+end_src

#+RESULTS:
: 1
: 3
: 5
: 7
: 9

#+begin_src js
let i = 3;

while (i) {
console.log( i-- );
}



#+end_src

#+RESULTS:
: 3
: 2
: 1

#+begin_src js
let i = 0;
while (++i < 5) console.log( i );

let j = 0;
while (j++ < 5) console.log( j );

#+end_src

#+RESULTS:
: 1
: 2
: 3
: 4
: 1
: 2
: 3
: 4
: 5

#+begin_src js
for(let i = 2; i <= 10 ; i++){
let flag = (i % 2 == 0)
if(flag){
    console.log(i)
}
}

#+end_src

#+RESULTS:
: 2
: 4
: 6
: 8
: 10

#+begin_src js
for (let i = 0; i < 3; i++) {
console.log( `number ${i}!` );
}

#+end_src

#+RESULTS:
: number 0!
: number 1!
: number 2!

#+begin_src js
// An integer number greater than 1 is called a prime if it cannot be divided without a remainder by anything except 1 and itself.

// In other words, n > 1 is a prime if it can’t be evenly divided by anything except 1 and n.

// For example, 5 is a prime, because it cannot be divided without a remainder by 2, 3 and 4.

// Write the code which outputs prime numbers in the interval from 2 to n.

// For n = 10 the result will be 2,3,5,7.

// P.S. The code should work for any n, not be hard-tuned for any fixed value.
let n = 10
for(let i = 2; i <= n ; i++){
let flag = true
for(let j = 2 ; j < i ; j++){
    if(i % j == 0){
        flag = false
    }
}
if(flag == true) console.log(i)
}
#+end_src

#+RESULTS:
: 2
: 3
: 5
: 7
* the switch statement

** task
#+begin_src js
let a = 2 + 2;

switch (a) {
case 3:
console.log( 'Too small' );
case 4:
console.log( 'Exactly!' );
case 5:
console.log( 'Too big' );
default:
console.log( "I don't know such values" );
}

#+end_src

#+RESULTS:
: Exactly!
: Too big
: I don't know such values

* functions
** task
#+begin_src js

function showMessage() {
console.log( 'Hello everyone!' );
}
showMessage()
#+end_src

#+RESULTS:
: Hello everyone!
#+begin_src js
let userName = 'John';

function showMessage() {
userName = "Bob"; // (1) changed the outer variable

let message = 'Hello, ' + userName;
console.log(message);
}

console.log( userName ); // John before the function call

showMessage();

console.log( userName ); // Bob, the value was modified by the function

#+end_src

#+RESULTS:
: John
: Hello, Bob
: Bob

#+begin_src js
let userName = 'John';

function showMessage() {
let userName = "Bob"; // declare a local variable

let message = 'Hello, ' + userName; // Bob
console.log(message);
}

// the function will create and use its own userName
showMessage();

console.log( userName ); // John, unchanged, the function did not access the outer variable


#+end_src

#+RESULTS:
: Hello, Bob
: John

#+begin_src js
// function checkAge(age) {
//   if (age > 18) {
//     return true;
//   } else {
//     return confirm('Did parents allow you?');
//   }
// }
// function checkAge(age) {
//     // 逻辑：如果 (age > 18) 为真，返回 true；否则返回 confirm(...) 的结果
//     return (age > 18) ? true : confirm('Did parents allow you?');
// }
function checkAge(age){
return (age > 18) || confirm('Did parents allow you?')
}
console.log(checkAge(99)
)
#+end_src

#+RESULTS:
: true

#+begin_src js
function min(a,b){
let result = (a < b) ? a: b
return result
}
console.log(min(1,2))

console.log(min(1,3))
console.log(min(2,8))
console.log(min(9,2))
#+end_src

#+RESULTS:
: 1
: 1
: 2
: 2

#+begin_src js
function pow(base,exp){
let res = 1
for(i = 0 ; i < exp ; i++){
    res *=base
}
return res
}
console.log(pow(2,3))

console.log(pow(5,3))
console.log(pow(6,3))
console.log(pow(8,3))



#+end_src

#+RESULTS:
: 8
: 125
: 216
: 512
* function experssion
#+begin_src js
function sayHi() {   // (1) create
console.log( "Hello" );
}

let func = sayHi;    // (2) copy

func(); // Hello     // (3) run the copy (it works)!
sayHi();


#+end_src

#+RESULTS:
: Hello
: Hello


* arrow functions , the basic
** task
#+begin_src js

// Node/Bun 专用测试版
let ask = (question, yes, no) => {
// 模拟 confirm，这里手动写死 true 或 false 来测试
let result = true; // 假装用户点了确定
result ? yes() : no();
}

ask(
"Do you agree?",
() => console.log("You agreed."),
() => console.log("You canceled.")
);
#+end_src

#+RESULTS:
: You agreed.
* javascript special
** task
* object
** task
#+begin_src js
function makeUser(name, age) {
return {
name: name,
age: age,
// ...other properties
};
}

let user = makeUser("John", 30);
console.log(user.name); // John

#+end_src

#+RESULTS:
: John
#+begin_src js
let obj = {};
obj.__proto__ = 5; // assign a number
console.log(obj.__proto__); // [object Object] - the value is an object, didn't work as intended

#+end_src

#+RESULTS:
: [Object: null prototype] {}

#+begin_src js
let user = {
name: "John",
age: 30,
isAdmin: true
};

for (let key in user) {
// keys
console.log( key );  // name, age, isAdmin
// values for the keys
console.log( user[key] ); // John, 30, true
}

#+end_src

#+RESULTS:
: name
: John
: age
: 30
: isAdmin
: true
#+begin_src js
let codes = {
"49": "Germany",
"41": "Switzerland",
"44": "Great Britain",
// ..,
"1": "USA"
};

for (let code in codes) {
console.log(code); // 1, 41, 44, 49
}

#+end_src

#+RESULTS:
: 1
: 41
: 44
: 49

#+begin_src js
// Number(...) explicitly converts to a number
// Math.trunc is a built-in function that removes the decimal part
console.log( String(Math.trunc(Number("49"))) ); // "49", same, integer property
console.log( String(Math.trunc(Number("+49"))) ); // "49", not same "+49" ⇒ not integer property
console.log( String(Math.trunc(Number("1.2"))) ); // "1", not same "1.2" ⇒ not integer property

#+end_src

#+RESULTS:
: 49
: 49
: 1

#+begin_src js
/**
,* Write the code, one line for each action:

Create an empty object user.
Add the property name with the value John.
Add the property surname with the value Smith.
Change the value of the name to Pete.

Remove the property name from the object.


,*/
let obj = {}
obj.name = "John"
obj.surname = "Smith"
obj.name = "Pete"
delete obj.name
for(let ob in obj){
console.log(obj[ob])
}

#+end_src


#+RESULTS:
: Smith

#+begin_src js
// Write the function isEmpty(obj) which returns true if the object has no properties, false otherwise.


let isEmpty = (obj) => {
for(let ob in obj){
    return false
}
return true
}
let schedule = {};

console.log( isEmpty(schedule) ); // true

schedule["8:30"] = "get up";

console.log( isEmpty(schedule) ); // false

#+end_src

#+RESULTS:
: true
: false

#+begin_src js
let salaries = {
John: 100,
Ann: 160,
Pete: 130
}
let sum = 0
for(let sal in salaries){
sum += salaries[sal]
}
console.log(sum)
#+end_src

#+RESULTS:
: 390
#+begin_src js
//Create a function multiplyNumeric(obj) that multiplies all numeric property values of obj by 2. before the call
let multiplyNumeric = (obj) =>{
for(let pro in obj){
    if(typeof obj[pro] == "number"){
        obj[pro] *=2
    }
}
}
let menu = {
width: 200,
height: 300,
title: "My menu"
};
let prt = (obj) => {
Object.keys(obj).forEach(key => {
    console.log(`${key}: ${obj[key]}`);
});
}
prt(menu)
multiplyNumeric(menu);

prt(menu)
// after the call
menu = {
width: 400,
height: 600,
title: "My menu"
};

#+end_src

#+RESULTS:
: width: 200
: height: 300
: title: My menu
: width: 400
: height: 600
: title: My menu
* object refenrence and copying
** task
#+begin_src js

function makeUser() {
return {
name: "John",
ref: this
};
}

let user = makeUser();

console.log( user.ref.name ); // What's the result?


#+end_src

#+RESULTS:
: undefined

#+begin_src js
let calculator = (a,b) =>{
// ... your code ...
return {

read(Newa,Newb){
    a = Newa,
    b = Newb
},
sum(){
    return a+b
},
mul(){
    return a*b
    },
}
};
let calc = calculator(0,0)
calc.read(1,2);
console.log( calc.sum() );
console.log( calc.mul() );

#+end_src

#+RESULTS:
: 3
: 2

#+begin_src js
let ladder = {
step: 0,
up() {
this.step++;
    return this
},
down() {
this.step--;
    return this
},
showStep: function() { // shows the current step
console.log( this.step );
    return this
}
};
ladder.showStep().up().down().up().up().up().up().up().up().up().up().showStep()
#+end_src

#+RESULTS:
: 0
: 8

* constructor and operator new
** task
#+begin_src js
/**
 ,* @return {Generator<number>}
 ,*/
var fibGenerator = function*() { // 这里的 * 表示它是生成器
    let current = 0;
    let next = 1;

    while (true) {
        // 1. 产出当前的值，然后函数在这里"冻结"暂停！
        // 等待外部调用 .next() 才会继续往下执行
        yield current;

        // 2. 重新计算数值（为了下一次苏醒做准备）
        // 利用解构赋值同时更新两个变量 (JS 的优雅写法)
        [current, next] = [next, current + next];
    }
};

  const gen = fibGenerator(); // 初始化，此时代码一行都没跑
  console.log(gen.next().value); // 跑进 while，碰到 yield current(0)，暂停。输出 0
console.log(gen.next().value)
console.log(gen.next().value)
console.log(gen.next().value)
console.log(gen.next().value)
console.log(gen.next().value)
console.log(gen.next().value)
/**
 ,* 使用演示：
 ,* const gen = fibGenerator(); // 初始化，此时代码一行都没跑
 ,* gen.next().value; // 跑进 while，碰到 yield current(0)，暂停。输出 0
 ,* gen.next().value; // 唤醒，计算新值，进入下一次循环，碰到 yield current(1)，暂停。输出 1
 ,*/
#+end_src

#+RESULTS:
: 0
: 1
: 1
: 2
: 3
: 5
: 8


#+begin_src js
function* foo(index) {
  while (index < 2) {
    yield index;
    index++;
  }
}

const iterator = foo(0);

console.log(iterator.next().value);
// Expected output: 0

console.log(iterator.next().value);
// Expected output: 1
#+end_src

#+RESULTS:
: 0
: 1

#+begin_src js
function* countAppleSales() {
  const saleList = [3, 7, 5];
  for (let i = 0; i < saleList.length; i++) {
    yield saleList[i];
  }
}
const appleStore = countAppleSales(); // Generator { }
console.log(appleStore.next()); // { value: 3, done: false }
console.log(appleStore.next()); // { value: 7, done: false }
console.log(appleStore.next()); // { value: 5, done: false }
console.log(appleStore.next()); // { value: undefined, done: true }
// for (const apple of appleStore) {
//   // apple 就是 yield 出来的 value
//   console.log('外部拿到:', apple);
// }
#+end_src

#+RESULTS:
: { value: 3, done: false }
: { value: 7, done: false }
: { value: 5, done: false }
: { value: undefined, done: true }
#+begin_src js
/**
 ,* @param {number[]} arr
 ,* @param {Function} fn
 ,* @return {number[]}
 ,*/
var filter = function(arr, fn) {
let filteredArr = []
let counter = 0
    for(let i of arr){

        if(fn(i,counter++)) filteredArr.push(i)
    }
    return filteredArr
};
#+end_src

#+RESULTS:

#+begin_src js
function User(name) {
  this.name = name;
  this.isAdmin = false;
}

let user = new User("Jack");

console.log(user.name); // Jack
console.log(user.isAdmin); // false
#+end_src

#+RESULTS:
: Jack
: false

#+begin_src js
function BigUser() {

  this.name = "John";

  return { name: "Godzilla" };  // <-- returns this object
}

console.log( new BigUser().name );  // Godzilla, got that object
#+end_src

#+RESULTS:
: Godzilla
#+begin_src js
function Calculator(){
   this.read=function(Newa,Newb){
       this.a = Newa;
       this.b = Newb;
   };
    this.sum = function(){
        return this.a+this.b
    };
    this.mul = function(){
        return this.a*this.b
    };
}
let calculator = new Calculator();
calculator.read(1,2);
console.log( "Sum=" + calculator.sum() );
console.log( "Mul=" + calculator.mul() );
#+end_src

#+RESULTS:
: Sum=3
: Mul=2

#+begin_src js
function Accumulator(Initvalue){
    this.StartingValue = Initvalue
    this.value = Initvalue
    this.read = function(input){
        this.value += input
    }
}
let accumulator = new Accumulator(1); // initial value 1

accumulator.read(3); // adds the user-entered value
accumulator.read(8); // adds the user-entered value

console.log(accumulator.value); // shows the sum of these values
#+end_src

#+RESULTS:
: 12

* optional chaining ?.
** task
#+begin_src js
let id = Symbol("id");
let is = "id"
console.log(id); // TypeError: Cannot convert a Symbol value to a string

console.log(is); // TypeError: Cannot convert a Symbol value to a string
#+end_src

#+RESULTS:
: Symbol(id)
: id
#+begin_src js
let id = Symbol("id");
let user = {
  name: "John",
  age: 30,
  [id]: 123
};

for (let key in user) console.log(key); // name, age (no symbols)

// the direct access by the symbol works
// console.log( "Direct: " + user[id] ); // Direct: 123
#+end_src

#+RESULTS:
: name
: age
* Object to primitive conversion
** task
#+begin_src js

let str = "Hello";

str.test = 5;

console.log(str.test);
#+end_src

#+RESULTS:
: undefined
* Numbers
** task
#+begin_src js

let billion = 1e9;  // 1 billion, literally: 1 and 9 zeroes

console.log( 7.3e9 );  // 7.3 billions (same as 7300000000 or 7_300_000_000)
// -3 divides by 1 with 3 zeroes
console.log(1e-3 === 1 / 1000); // 0.001

// -6 divides by 1 with 6 zeroes
console.log(1.23e-6 === 1.23 / 1000000); // 0.00000123
console.log(1234..toString(2));
// an example with a bigger number
console.log(1234e-2 === 1234 / 100); // 12.34, decimal point moves 2 times

console.log(Math.trunc(2.3));
console.log(0.1.toString(2)); // 0.0001100110011001100110011001100110011001100110011001101
console.log(0.2.toString(2)); // 0.001100110011001100110011001100110011001100110011001101
console.log((0.1 + 0.2).toString(2)); // 0.0100110011001100110011001100110011001100110011001101

console.log((0.1 + 0.3+ 0.1).toString(2)); // 0.0100110011001100110011001100110011001100110011001101
#+end_src


#+RESULTS:
#+begin_example
7300000000
true
true
10011010010
true
2
0.0001100110011001100110011001100110011001100110011001101
0.001100110011001100110011001100110011001100110011001101
0.0100110011001100110011001100110011001100110011001101
0.1
#+end_example



#+begin_src js
let a = Math.random(1)
console.log(a)
#+end_src

#+RESULTS:
: 0.857440850338862

#+begin_src js
function sum(num1,num2){
   return num1 + num2
}
console.log(sum(1,3))
console.log( 6.35.toFixed(1) ); // 6.3
let i = 0;
while (i < 11) {
  i += 0.2;
  if (i > 9.8 && i < 10.2) console.log( i );
}
#+end_src

#+RESULTS:
: 4
: 6.3
: 9.999999999999996
: 10.199999999999996
* string
** task
#+begin_src js

let guestList = `Guests:
 * John
 * Pete
 * Mary
`;

console.log(guestList); // a list of guests, multiple lines
#+end_src

#+RESULTS:
: Guests:
:  * John
:  * Pete
:  * Mary
:

#+begin_src js
for (let char of "Hello") {
  console.log(char); // H,e,l,l,o (char becomes "H", then "e", then "l" etc)
}
let str = 'Widget with id';

console.log( str.indexOf('Widget') ); // 0, because 'Widget' is found at the beginning
console.log( str.indexOf('widget') ); // -1, not found, the search is case-sensitive

console.log( str.indexOf("id") ); // 1, "id" is found at the position 1 (..idget with id)
#+end_src

#+RESULTS:
: H
: e
: l
: l
: o
: 0
: -1
: 1

#+begin_src js
function truncate(str,maxLength){
    if(str.length <= maxLength){
        return str
    }
    return str.substr(0,maxLength -1) + "..."
}
console.log(truncate("What I'd like to tell on this topic is:", 20) )
console.log(truncate("Hi everyone!", 20))
#+end_src

#+RESULTS:
: What I'd like to te...
: Hi everyone!
#+begin_src js
 function extractCurrencyValue(str){
     return relStr = +str.substr(1,str.length - 1)
 }
console.log(extractCurrencyValue("$120")===120)
#+end_src

#+RESULTS:
: true

#+begin_src js
 function checkSpam(str){
     if(str.toUpperCase().indexOf("XXX") !== -1 || (str.toLowerCase().indexOf("viagra")) !== -1){
         return true
     }return false
 }
console.log(checkSpam('buy ViAgRA now') )
console.log(checkSpam('free xxxxx')  )
console.log(checkSpam("innocent rabbit") )
#+end_src

#+RESULTS:
: true
: true
: false

#+begin_src js
function ucFirst(str){
    return    str.slice(0,1).toUpperCase() + str.slice(1)
}

console.log(ucFirst("john") == "John")
#+end_src

#+RESULTS:
: true

* Array
** task
#+begin_src js

// 设定一个稍微大一点的数量级，让差距肉眼可见
const COUNT = 100000;

// 创建两个一样的巨大数组
const arrForShift = new Array(COUNT).fill(1);
const arrForPop = new Array(COUNT).fill(1);

console.log(`=== 开始测试: 操作 ${COUNT} 个元素 ===`);

// 1. 测试 Shift (从头部删除)
console.time('Shift 耗时');
while (arrForShift.length > 0) {
    arrForShift.shift();
}
console.timeEnd('Shift 耗时');

// 2. 测试 Pop (从尾部删除)
console.time('Pop  耗时');
while (arrForPop.length > 0) {
    arrForPop.pop();
}
console.timeEnd('Pop  耗时');
#+end_src

#+RESULTS:
: === 开始测试: 操作 100000 个元素 ===
: Shift 耗时: 355.148ms
: Pop  耗时: 0.711ms

#+begin_src js
let fruits = ["Apples", "Pear", "Orange"];

// push a new value into the "copy"
let shoppingCart = fruits;
shoppingCart.push("Banana");

// what's in fruits?
console.log( fruits.length ); // ?



#+end_src

#+RESULTS:
: 4
: 3


#+begin_src js

let style = ["Jazz","blue"]
console.log(style)
style.push("Rock-n-Roll")
console.log(style)
style[(style.length-1)/2] = "Classics"
console.log(style)
console.log(style.shift())
console.log(style)
style.unshift("Rag","Reggae")
console.log(style)

#+end_src

#+RESULTS:
: [ 'Jazz', 'blue' ]
: [ 'Jazz', 'blue', 'Rock-n-Roll' ]
: [ 'Jazz', 'Classics', 'Rock-n-Roll' ]
: Jazz
: [ 'Classics', 'Rock-n-Roll' ]
: [ 'Rag', 'Reggae', 'Classics', 'Rock-n-Roll' ]

#+begin_src js
let arr = ["a", "b"];

arr.push(function() {
  console.log( this );
});


arr[2](); // ?


#+end_src

#+RESULTS:
: [ 'a', 'b', [Function (anonymous)] ]

#+begin_src js

let arr = [1, -2, 3, 4, -9, 6]
function getMaxSubSum(arr){
    let max = arr[0]
    let relstr = []
    let range = arr.length -1
    for(let i = 0; i <= range ;i++){
    let acc = 0
        for(let j = i ; j <= range ; j++){
            acc += arr[j]
            // max = (max > acc) ? max:acc
           if(max <= acc){
              max = acc
              relstr = arr.slice(i,j+1)
           }
        }
    }
    return relstr
}
// console.log(getMaxSubSum(arr))
// getMaxSubSum([-1, 2, 3, -9]) == 5 (the sum of highlighted items)
// getMaxSubSum([2, -1, 2, 3, -9]) == 6
// getMaxSubSum([-1, 2, 3, -9, 11]) == 11
// getMaxSubSum([-2, -1, 1, 2]) == 3
// getMaxSubSum([100, -9, 2, -3, 5]) == 100
// getMaxSubSum([1, 2, 3]) == 6 (take all)
console.log(getMaxSubSum([-1, 2, 3, -9]))
console.log(getMaxSubSum([2, -1, 2, 3, -9]))
console.log(getMaxSubSum([-1, 2, 3, -9, 11]))
console.log(getMaxSubSum([-2, -1, 1, 2]))
console.log(getMaxSubSum([100, -9, 2, -3, 5]))
console.log(getMaxSubSum([1, 2, 3]))
#+end_src

#+RESULTS:
: [ 2, 3 ]
: [ 2, -1, 2, 3 ]
: [ 11 ]
: [ 1, 2 ]
: [ 100 ]
: [ 1, 2, 3 ]

#+begin_src js
/**
 * @param {number[]} nums
 * @return {void}
 */
var ArrayWrapper = function(nums) {
    // 1. 构造函数：把传进来的 nums 存到当前实例(this)上
    this.nums = nums;
};

/**
 * @return {number}
 */
ArrayWrapper.prototype.valueOf = function() {
    // 2. 求和逻辑：当发生 obj1 + obj2 时调用
    // 使用 reduce 把数组里的数加起来
    // 如果数组是空的，返回 0
    return this.nums.reduce((sum, num) => sum + num, 0);
}

/**
 * @return {string}
 */
ArrayWrapper.prototype.toString = function() {
    // 3. 转字符串逻辑：当 String(obj) 时调用
    // 偷懒做法：直接用 JSON.stringify，它会自动把 [1,2] 变成字符串 "[1,2]"
    return JSON.stringify(this.nums);
}

/**
 * 测试一下：
 */
const obj1 = new ArrayWrapper([1,2]);
const obj2 = new ArrayWrapper([3,4]);

console.log(obj1 + obj2); // 自动调 valueOf -> 3 + 7 = 10
console.log(String(obj1)); // 自动调 toString -> "[1,2]"
#+end_src

#+RESULTS:
: 10
: [1,2]

#+begin_src js
class Calculator {

    /**
     ,* @param {number} value
     ,*/
    constructor(value) {
        this.result = value
        return this
    }

    /**
     ,* @param {number} value
     ,* @return {Calculator}
     ,*/
    add(value){
       this.result += value

        return this
    }

    /**
     ,* @param {number} value
     ,* @return {Calculator},*/
    subtract(value){
       this.result -= value

        return this
    }

    /**
     ,* @param {number} value
     ,* @return {Calculator}
     ,*/
    multiply(value) {
       this.result *= value

        return this
    }

    /**
     ,* @param {number} value
     ,* @return {Calculator}
     ,*/
    divide(value) {
        if(value == 0){
            throw new Error("Division by zero is not allowed");
        }
       this.result /= value

        return this
    }

    /**
     ,* @param {number} value
     ,* @return {Calculator}
     ,*/
    power(value) {
       this.result =Math.pow(this.result,value)

        return this
    }

    /**
     ,* @return {number}
     ,*/
    getResult() {
       return this.result
    }
}
#+end_src
#+begin_src js
/**
 ,* Definition for singly-linked list.
 ,* function ListNode(val, next) {
 ,*     this.val = (val===undefined ? 0 : val)
 ,*     this.next = (next===undefined ? null : next)
 ,* }
 ,*/
/**
 ,* @param {ListNode} l1
 ,* @param {ListNode} l2
 ,* @return {ListNode}
 ,*/
function ListNode(val,next){
    this.val = (val === undefined ? 0 : val)
    this.next = (next === undefined ? null : next)
}
// 2,4,3
// 5,6,4
const l1 = new ListNode(2);       // 头节点是 2
l1.next = new ListNode(4);        // 2 后面连个 4
l1.next.next = new ListNode(3);   // 4 后面连个 3

// 3. 造 l2: [5, 6, 4]
const l2 = new ListNode(5);
l2.next = new ListNode(6);
l2.next.next = new ListNode(4);

var addTwoNumbers = function(l1, l2) {
    // 1. 造一个假的头，方便后面挂节点
    let dummy = new ListNode(0);
    let current = dummy; // current 是个搬砖工，负责一直往后铺路
    let carry = 0;       // 进位

    // 2. 循环条件：只要 l1 还没走完，或者 l2 还没走完，或者 还有进位没处理
    // 就可以一直循环 ( || 表示“或者”)
    while (l1 !== null || l2 !== null || carry > 0) {

        // === 第一步：取值 ===
        // 如果 l1 还是个节点，就取它的值；如果是 null，就当成 0
        let val1 = (l1 !== null) ? l1.val : 0;
        let val2 = (l2 !== null) ? l2.val : 0;

        // === 第二步：求和 ===
        // sum = val1 + val2 + 之前的进位
        let sum = val1 + val2 + carry;

        // === 第三步：算新进位和当前位 ===
        // 比如 sum 是 15。
        // carry 应该是 1  (用 Math.floor(sum / 10))
        // 当前位应该是 5  (用 sum % 10)
        carry = Math.floor(sum / 10);
        let digit = sum % 10;

        // === 第四步：造新节点挂到 l3 后面 ===
        current.next = new ListNode(digit);

        // === 第五步：移动指针 ===
        // current 必须往前走一步，站在刚造好的节点上，准备接下一个
        current = current.next;

        // l1 和 l2 也要往前走（前提是它们还没走到 null）
        if (l1 !== null) l1 = l1.next;
        if (l2 !== null) l2 = l2.next;
    }

    // 3. 返回假头后面的真链表
    return dummy.next;
};
console.log(addTwoNumbers(l1,l2))

#+end_src

#+RESULTS:
: ListNode {
:   val: 7,
:   next: ListNode { val: 0, next: ListNode { val: 8, next: null } }
: }
